app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
        format.html { redirect_to @product, notice: 'Product was successfully created.' }
        format.json { render :show, status: :created, location: @product }
        user_params[:labels_attributes]["0"][:title].split(',').each do |label|
          new_label = Label.create(title: label.strip)
---
INSERT INTO `products` (`title`, `description`, `price`, `created_at`, `updated_at`, `user_id`) VALUES ('rtzzz', 'rzz', 1.0, '2016-12-21 16:47:55', '2016-12-21 16:47:55', 1)
INSERT INTO `labels` (`title`) VALUES ('Pierre')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `price` = 1.2, `updated_at` = '2016-12-19 16:33:39' WHERE `products`.`id` = 2