app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        format.html { redirect_to @user, notice: 'User was successfully created.' }
        format.json { render :show, status: :created, location: @user }
        user_params[:labels_attributes]["0"][:title].split(',').each do |label|
          new_label = Label.create(title: label.strip)
---
INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('moi', 'moi@moi.moi', 'moi', '2016-12-20 10:29:36', '2016-12-20 10:29:36')
INSERT INTO `labels` (`title`) VALUES ('Pierre')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$l7KsVNsJqSglDfqd3CPRSOmCwskFjVGxWs2fHOPI8E6a7UMBHHkLq', `updated_at` = '2016-12-22 16:14:39' WHERE `users`.`id` = 1